10/data/attachments/27de6d963df956a4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7444482f-8ed0-41ff-ad95-d03ed854b623</nif:username>
            <nif:friendToBeAdded>Richard_detail_Friend_51012_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>